import React from "react";
import { Container } from "react-bootstrap";

const style = { textIndent: "20px" };

export function AboutSite() {
  return (
    <Container fluid style={{ maxWidth: "90vw" }}>
      <h2 className="text-center m-3">
        <b>Департамент юридичного забезпечення Міністерства оборони України</b>
      </h2>
      <p style={style}>
        На виконання вимог пункту 2 Загального положення про юридичну службу
        міністерства, іншого органу виконавчої влади, державного підприємства,
        установи та організації, затвердженого постановою Кабінету Міністрів
        України від 26 листопада 2008 року № 1040 (далі — Загальне положення про
        юридичну службу), відповідно до Положення про Департамент юридичного
        забезпечення Міністерства оборони України, затвердженого наказом
        Міністерства оборони України від 11.06.2020 № 190 у Міністерстві оборони
        України (далі — Міноборони) функціонує юридична служба як самостійний
        структурний підрозділ — Департамент юридичного забезпечення Міністерства
        оборони України (далі — Департамент), що здійснює свою діяльність у
        складі 5 відділів (згідно з головними напрямами діяльності юридичної
        служби), які входять до 2 управлінь, та сектору організації
        представництва в судах.
      </p>
      <p style={style}>
        Згідно з пунктом 5 Загального положення про юридичну службу і Схеми
        спрямування та координації діяльності структурних підрозділів
        Міністерства оборони України, затвердженої наказом Міністерства оборони
        України від 22.09.2020 № 346 Департамент підпорядковується безпосередньо
        Міністру оборони України, який спрямовує та контролює його діяльність.
      </p>
      <p style={style}>
        Департамент є юридичною службою апарату Міністерства оборони України, що
        виконує завдання із забезпечення реалізації державної політики з питань
        національної безпеки у воєнній сфері, сферах оборони і військового
        будівництва у мирний час та особливий період та забезпечує організацію
        правової роботи, спрямованої на правильне застосування, дотримання та
        запобігання невиконанню вимог законодавства України під час виконання
        покладених на Міністерство оборони України (далі — Міноборони) завдань і
        функцій, а також представництва інтересів Міноборони в судах та інших
        юрисдикційних органах.
      </p>
      <p style={style}>
        Департамент є самостійним структурним підрозділом апарату Міноборони,
        здійснює управління підпорядкованими йому територіальними юридичними
        підрозділами, Військово-юридичним інститутом Національного юридичного
        університету імені Ярослава Мудрого (далі — Військово-юридичний
        інститут) та загальне керівництво юридичними службами системи
        Міноборони.
      </p>
      <p style={style}>Основними завданнями Департаменту є:</p>
      <ul>
        <li>
          планування та координація законопроєктної та нормотворчої роботи
          Міноборони, за результатами узагальнення практики застосування
          законодавства з питань, що належать до компетенції Міноборони, та
          надання керівництву Міноборони пропозицій щодо вдосконалення
          законодавчих актів, актів Президента України і Кабінету Міністрів
          України для внесення їх в установленому порядку на розгляд Кабінету
          Міністрів України та Президенту України;
        </li>
        <li>
          здійснення правової роботи в апараті Міноборони, а також організація
          правової роботи в територіальних юридичних підрозділах,
          Військово-юридичному інституті, частинах та організаціях
          безпосереднього підпорядкування Міноборони, Збройних Силах України
          (далі — Збройні Сили), Державній спеціальній службі транспорту (далі —
          Держспецтрансслужба) та на державних підприємствах, установах,
          організаціях, що належать до сфери управління Міноборони;
        </li>
      </ul>
      <h4 style={{ textAlign: "center", textIndent: "20px" }}>
        Керівництво Департаменту юридичного забезпечення Міністерства оборони
        України
      </h4>
      <p>
        Тимчасово виконуючий обов’язки директора Департаменту юридичного
        забезпечення Міністерства оборони України полковник юстиції ГАНКЕВИЧ
        Кирило Борисович
      </p>
      <p>
        Заступник директора Департаменту юридичного забезпечення Міністерства
        оборони України КАМІНЕЦЬКИЙ Олексій Валентинович
      </p>
      <p>
        Заступник директора департаменту — начальник управління юридичного
        супроводження фінансово-господарської діяльності Департаменту юридичного
        забезпечення Міністерства оборони України ГОМОН Олександр Олександрович
      </p>
      <p>
        Уповноважений з гендерних питань - радник директора Департаменту
        юридичного забезпечення Міністерства оборони України капітан юстиції
        КОНЧУК Наталія Сергіївна
      </p>
      <p>
        Номер телефону чергового Департаменту юридичного забезпечення
        Міністерства оборони України: 454-40-37,231-37
      </p>
    </Container>
  );
}
